"use client";

import React from "react";
import TextAnimation from "./TextAnimation";
import Image from "next/image";
import ModalExample from "./Modal";
import ModalHistory from "./ModalHistory";

const Taruh = () => {
  return (
    <div id="tarih" className="h-screen py-10 relative px-20">
      <TextAnimation>
        <div className="w-1/2 text-6xl font-bold justify-center flex items-end text-[#FEAB5F]">
          Tarih
        </div>
      </TextAnimation>
      <div className=" bg-[#3E3E4D] text-white rounded-[3rem] p-10 w-[40rem] mt-20 ">
        <div className="text-[#FEAB5F] text-4xl font-black pb-5 text-center">
          OQYNYZ
        </div>
        <div className="text-lg">
          Aqmola oblysynyń toponımderi týraly maqalalar aımaqtyń mádenıetin,
          tarıhyn jáne tabıgı erekshelikterin kórsetetin geografıalyq ataýlardyń
          magynasyn ashady. Zertteýler kórsetkendeı, kóptegen ataýlar etnıkalyq
          muradan bastaý alady jáne taýlar, jartastar jáne ken oryndary sıaqty
          geografıalyq erekshelikterdi sıpattaıdy. Mysaldar: Kókshetaý, Eltas,
          Altyntaý. Bul ataýlar adamnyń tabıgatpen baılanysyn túsinýge
          kómektesedi jáne aımaqtyń tarıhı jadyn saqtaıdy.
        </div>
        <div className="text-[#FEAB5F] text-xl font-medium text-center pt-5">
          <ModalHistory
            title="Ақмола облысының тарихы"
            desc="Ирина Бекзатқызының зерттеу жұмысы Ақмола облысының тарихи топонимдерін зерттеуге арналған және оның негізгі мақсаты – географиялық атаулар арқылы қазақ халқының тарихы мен мәдени мұрасын ашу. Зерттеу барысында Ақмола өңірінің топонимдеріне тарихи-географиялық, этнографиялық және лингвистикалық тұрғыдан талдау жасалып, көптеген тарихи атаулардың қалпына келтірілуі қажеттілігі атап өтілген. Бұл жер атауларының тек географиялық қана емес, тарихи-мәдени маңызы зор екенін көрсетеді.
Зерттеуші қазақ топонимдерінің халықтың тарихи-мәдени кодын сақтай отырып, ұлттық идеологияны қалыптастырудағы маңызды рөлін атап өтеді. Ақмола облысы, Сарыарқа аймағының топонимдері осы өлкені мекендеген халықтардың көші-қон тарихынан бастап, түрлі этникалық топтардың өзара байланысы және тарихи өзгерістердің куәгері екенін көрсетеді.
Сонымен қатар, Ирина Бекзатқызы еңбегінде Ақмола облысын зерттеген ғалымдар мен зерттеушілердің тарихи еңбектеріне шолу жасайды. Бұл еңбектердің қатарында В.Н. Татищев, П.И. Рычков, А. Левшин, И.Я. Словцов сияқты ғалымдардың зерттеулері бар. Олардың еңбектері арқылы Ақмола облысының тарихи географиясы, мәдениеті мен табиғи ерекшеліктері жөнінде мәліметтер жинақталып, аймақтың топонимиялық құрылымының қалыптасуында маңызды орын алады.
Зерттеу жұмысында Ақмола облысының кейбір тарихи атаулары қайта ұсынылып, олардың бастапқы мәні мен мағынасы түсіндіріледі. Сонымен қатар, дереккөздер ретінде Қазақстан Республикасы Орталық мемлекеттік архивінің (ҚРОМА), Омбы облыстық тарихи архивінің (ООТА), Нұр-Сұлтан қаласы мемлекеттік архивінің (НҚМА) құжаттары, жергілікті өлкетанушылардың жазбалары және автордың өзі жүргізген далалық этнографиялық экспедиция материалдары қолданылған.
Бұл зерттеу жұмысы қазақ халқының мәдени-тарихи мұрасын сақтау, ұлттық топонимдерді қалпына келтіру және оларды болашақ ұрпаққа жеткізудегі маңыздылығын дәлелдейді. Мақалада Ақмола облысының топонимдерінің тарихы мен географиялық ерекшеліктері қарастырылады. Онда жер-су атауларының қалыптасуына табиғи рельеф, пайдалы қазбалар, климаттық факторлар әсер еткені айтылады. Тау, тас, көл атаулары жер бедерінің сипатына байланысты қойылған, мысалы, 'Қойтас' және 'Керегетас' атаулары. Сонымен қатар, өзен-көлдердің атаулары ежелгі дәуірлерден бері сақталған және географиялық нысандардың дамуын көрсетеді. Ақмола облысының топонимдері арқылы оның географиялық және тарихи ерекшеліктерін тануға болады."
            imageUrl="/yesil.jpg"
          >
            tolygyraq...
          </ModalHistory>
        </div>
      </div>
      <div className="absolute z-0 -right-[15rem] top-1/2 translate-y-[-50%] w-[60rem] overflow-hidden rounded-[5rem] h-[40rem] object-cover">
        <Image
          src={"/baaa.png"}
          width={10000}
          height={10000}
          alt="as"
          className="z-0"
        />
      </div>
    </div>
  );
};

export default Taruh;
